---
kind: type
id: T:Autodesk.Revit.DB.OpenOptions
source: html/c0004971-3810-eeb8-72bd-e116886ec3c8.htm
---
# Autodesk.Revit.DB.OpenOptions

This class contains options available for opening a document from disk.

## Syntax (C#)
```csharp
public class OpenOptions : IDisposable
```